#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.5`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=1b64caca607e392bc85ff27243e6022401cc3184][0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/assis-dev-uai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001][0m
[0m[1mazapi_resource.subnet_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/WebAppSubnet][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001/providers/Microsoft.Authorization/roleAssignments/1ee9a094-ab46-e677-e809-f525661dd971][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001/providers/Microsoft.Authorization/roleAssignments/185345e3-07d6-983c-8a7d-06dc7e69a5df][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/cbdaaa00-91bb-8455-e391-0a217983d44a][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001/deployments/gpt-4o][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-kv001-vault-pe][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-aoai001-account-pe][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-02T21:14:47Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-02T21:13:17Z][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Reading...[0m[0m
[0m[1mazurerm_linux_web_app.linux_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001][0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.bot_service.azurerm_application_insights_api_key.application_insights_api_key: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001/apiKeys/81a054f7-a277-4164-85db-441c1b2e172a][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001|applicationLogs-0][0m
[0m[1mazurerm_private_endpoint.linux_web_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001|logAnalytics][0m
[0m[1mmodule.bot_service.azurerm_bot_service_azure_bot.bot_service_azure_bot: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.BotService/botServices/assis-dev-bot001][0m
[0m[1mmodule.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_token: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-bot001-token-pe][0m
[0m[1mmodule.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot: Reading...[0m[0m
[0m[1mmodule.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_bot: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-bot001-bot-pe][0m
[0m[1mmodule.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.BotService/botServices/assis-dev-bot001][0m
[0m[1mmodule.bot_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_bot_service_azure_bot["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.BotService/botServices/assis-dev-bot001|applicationLogs-0][0m
[0m[1mmodule.bot_service.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-02T21:16:28Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001"
    }

[1m  # azurerm_linux_web_app.linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_web_app" "linux_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "AZURE_OPENAI_SYSTEM_PROMPT"                 = <<-EOT
                You are a world-class assistant who tells jokes. For anything but jokes, respond politely that you are just trying to make everyone’s life a happier place.
            EOT
            [90m# (13 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001"
        name                                           = "assis-dev-app001"
        tags                                           = {
            "workload" = "assis"
        }
        [90m# (24 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_web_app" {
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log {
          [32m+[0m[0m eventhub_authorization_rule_id = (known after apply)
          [32m+[0m[0m eventhub_name                  = (known after apply)
          [32m+[0m[0m id                             = (known after apply)
          [32m+[0m[0m log_analytics_destination_type = (known after apply)
          [32m+[0m[0m log_analytics_workspace_id     = (known after apply)
          [32m+[0m[0m name                           = (known after apply)
          [32m+[0m[0m partner_solution_id            = (known after apply)
          [32m+[0m[0m storage_account_id             = (known after apply)
          [32m+[0m[0m target_resource_id             = (known after apply)
        } -> (known after apply)

      [33m~[0m[0m metric {
          [32m+[0m[0m eventhub_authorization_rule_id = (known after apply)
          [32m+[0m[0m eventhub_name                  = (known after apply)
          [32m+[0m[0m id                             = (known after apply)
          [32m+[0m[0m log_analytics_destination_type = (known after apply)
          [32m+[0m[0m log_analytics_workspace_id     = (known after apply)
          [32m+[0m[0m name                           = (known after apply)
          [32m+[0m[0m partner_solution_id            = (known after apply)
          [32m+[0m[0m storage_account_id             = (known after apply)
          [32m+[0m[0m target_resource_id             = (known after apply)
        } -> (known after apply)
    }

[1mPlan:[0m 0 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>